In [10]:
import pandas as pd
df=pd.read_csv(r"../Datasets/ClimateTest.csv")

In [11]:
df.head()

         date   meantemp   humidity  wind_speed  meanpressure
0  2017-01-01  15.913043  85.869565    2.743478     59.000000
1  2017-01-02  18.500000  77.222222    2.894444   1018.277778
2  2017-01-03  17.111111  81.888889    4.016667   1018.333333
3  2017-01-04  18.700000  70.050000    4.545000   1015.700000
4  2017-01-05  18.388889  74.944444    3.300000   1014.333333

In [12]:
df.loc[0,"date"].day_name()
# so it is not in DateTime format.

AttributeError: 'str' object has no attribute 'day_name'

In [ ]:
#converted into Datetime
df["date"]=pd.to_datetime(df["date"], format='%Y-%m-%d')
df["date"]

0     2017-01-01
1     2017-01-02
2     2017-01-03
3     2017-01-04
4     2017-01-05
         ...
109   2017-04-20
110   2017-04-21
111   2017-04-22
112   2017-04-23
113   2017-04-24
Name: date, Length: 114, dtype: datetime64[ns]

In [ ]:
df.loc[0,"date"].day_name()

'Sunday'

In [ ]:
# we can get day of the week for each of the dates in this series. 
df["date"].dt.day_name()

0         Sunday
1         Monday
2        Tuesday
3      Wednesday
4       Thursday
         ...
109     Thursday
110       Friday
111     Saturday
112       Sunday
113       Monday
Name: date, Length: 114, dtype: object

In [26]:
# assigining new column
df["day"]=df["date"].dt.day_name()
df

          date   meantemp   humidity  wind_speed  meanpressure        day
0   2017-01-01  15.913043  85.869565    2.743478     59.000000     Sunday
1   2017-01-02  18.500000  77.222222    2.894444   1018.277778     Monday
2   2017-01-03  17.111111  81.888889    4.016667   1018.333333    Tuesday
3   2017-01-04  18.700000  70.050000    4.545000   1015.700000  Wednesday
4   2017-01-05  18.388889  74.944444    3.300000   1014.333333   Thursday
..         ...        ...        ...         ...           ...        ...
109 2017-04-20  34.500000  27.500000    5.562500    998.625000   Thursday
110 2017-04-21  34.250000  39.375000    6.962500    999.875000     Friday
111 2017-04-22  32.900000  40.900000    8.890000   1001.600000   Saturday
112 2017-04-23  32.875000  27.500000    9.962500   1002.125000     Sunday
113 2017-04-24  32.000000  27.142857   12.157143   1004.142857     Monday

[114 rows x 6 columns]

In [ ]:
# Earliest Date in this dataFrame. 
df["date"].min()

Timestamp('2017-01-01 00:00:00')

In [28]:
df["date"].max()

Timestamp('2017-04-24 00:00:00')

In [ ]:
df["date"].max()-df["date"].min()
# so we have 113 days in this entire data.

Timedelta('113 days 00:00:00')

In [ ]:
# Datetime components extraction: Use the .dt accessor to extract parts of the datetime like year, month, day, hour, and minute which are often necessary for analysis.
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df

,date,meantemp,humidity,wind_speed,meanpressure,day,year,month
0,2017-01-01,15.913043,85.869565,2.743478,59.000000,1,2017,1
1,2017-01-02,18.500000,77.222222,2.894444,1018.277778,2,2017,1
2,2017-01-03,17.111111,81.888889,4.016667,1018.333333,3,2017,1
3,2017-01-04,18.700000,70.050000,4.545000,1015.700000,4,2017,1
4,2017-01-05,18.388889,74.944444,3.300000,1014.333333,5,2017,1
...,...,...,...,...,...,...,...,...
109,2017-04-20,34.500000,27.500000,5.562500,998.625000,20,2017,4
110,2017-04-21,34.250000,39.375000,6.962500,999.875000,21,2017,4
111,2017-04-22,32.900000,40.900000,8.890000,1001.600000,22,2017,4
112,2017-04-23,32.875000,27.500000,9.962500,1002.125000,23,2017,4
113,2017-04-24,32.000000,27.142857,12.157143,1004.142857,24,2017,4

In [35]:
# create filters using datetime
df["year"].nunique()

1

In [39]:
filter=(df["date"]>="2016") & (df["date"]<"2018")
df.loc[filter]

#since we only have data of 2017 so we got everything as result.

,date,meantemp,humidity,wind_speed,meanpressure,day,year,month
0,2017-01-01,15.913043,85.869565,2.743478,59.000000,1,2017,1
1,2017-01-02,18.500000,77.222222,2.894444,1018.277778,2,2017,1
2,2017-01-03,17.111111,81.888889,4.016667,1018.333333,3,2017,1
3,2017-01-04,18.700000,70.050000,4.545000,1015.700000,4,2017,1
4,2017-01-05,18.388889,74.944444,3.300000,1014.333333,5,2017,1
...,...,...,...,...,...,...,...,...
109,2017-04-20,34.500000,27.500000,5.562500,998.625000,20,2017,4
110,2017-04-21,34.250000,39.375000,6.962500,999.875000,21,2017,4
111,2017-04-22,32.900000,40.900000,8.890000,1001.600000,22,2017,4
112,2017-04-23,32.875000,27.500000,9.962500,1002.125000,23,2017,4
113,2017-04-24,32.000000,27.142857,12.157143,1004.142857,24,2017,4